* Learn English
** DONE 2017年4月19日<2017-04-19 Wed 20:36> 常用单词 97.4%
   CLOSED: [2017-04-19 Wed 20:45]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-04-19 Wed 20:45]
   CLOCK: [2017-04-19 Wed 20:34]--[2017-04-19 Wed 20:45] =>  0:11
   :END:
** DONE 2017年4月20日<2017-04-20 Thu 19:36> 颜色和比例 95.%
   CLOSED: [2017-04-20 Thu 19:36]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-04-20 Thu 19:36]
   CLOCK: [2017-04-20 Thu 19:24]--[2017-04-20 Thu 19:36] =>  0:12
   :END:
** DONE 2017年4月23日<2017-04-23 Sun 09:59> 常用单词 96.3%
   CLOSED: [2017-04-23 Sun 09:59]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-04-23 Sun 09:59]
   CLOCK: [2017-04-23 Sun 09:50]--[2017-04-23 Sun 09:59] =>  0:09
   :END:
*** DONE 23_2<2017-04-23 Sun 10:10>常用单词 97.7%
    CLOSED: [2017-04-23 Sun 10:10]
    :LOGBOOK:
    - State "DONE"       from "STARTED"    [2017-04-23 Sun 10:10]
    CLOCK: [2017-04-23 Sun 10:02]--[2017-04-23 Sun 10:10] =>  0:08
    :END:
*** DONE 23_3<2017-04-23 Sun 15:23> watch IT狂人s1e1
    CLOSED: [2017-04-23 Sun 15:23]
    :LOGBOOK:
    - State "DONE"       from "STARTED"    [2017-04-23 Sun 15:23]
    CLOCK: [2017-04-23 Sun 14:58]--[2017-04-23 Sun 15:23] =>  0:25
    :END:
*** DONE 23_4<2017-04-23 Sun 15:50> 颜色和比例 96.6%
    CLOSED: [2017-04-23 日 15:50]
    :LOGBOOK:
    - State "DONE"       from "STARTED"    [2017-04-23 日 15:50]
    CLOCK: [2017-04-23 日 15:37]--[2017-04-23 日 15:50] =>  0:13
    :END:
** DONE 2017年4月24日<2017-04-24 Mon 20:11> 介词.空间位置 94.9%
   CLOSED: [2017-04-24 Mon 20:33]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-04-24 Mon 20:33]
   CLOCK: [2017-04-24 Mon 20:11]--[2017-04-24 Mon 20:33] =>  0:22
   :END:
** DONE 2017年4月25日<2017-04-25 Tue 08:06> 颜色和比例 97.0%
   CLOSED: [2017-04-25 Tue 20:17]
   :LOGBOOK:
** DONE 2017年4月26日<2017-04-26 Wed 13:48> 介词.空间位置 96.1%
   CLOSED: [2017-04-26 Wed 14:06]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-04-26 Wed 14:06]
   CLOCK: [2017-04-26 Wed 13:48]--[2017-04-26 Wed 14:06] =>  0:18
   CLOCK: [2017-04-25 Tue 20:06]--[2017-04-25 Tue 20:17] =>  0:11
   :END:
   - State "DONE"       from "STARTED"    [2017-04-25 Tue 20:17]
   :END:
** DONE 2017年4月27日<2017-04-27 Thu 08:15> 常用单词 97.3%
   CLOSED: [2017-04-27 Thu 08:23]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-04-27 Thu 08:23]
   CLOCK: [2017-04-27 Thu 08:15]--[2017-04-27 Thu 08:23] =>  0:08
   :END:
*** DONE 2017年4月27日 下午<2017-04-27 Thu 15:16> 常用单词 98.2%
    CLOSED: [2017-04-27 Thu 15:26]
    :LOGBOOK:
    - State "DONE"       from "STARTED"    [2017-04-27 Thu 15:26]
    CLOCK: [2017-04-27 Thu 15:17]--[2017-04-27 Thu 15:26] =>  0:09
    :END:
*** DONE typing<2017-04-27 Thu 15:29> 常用单词 99.1%
    CLOSED: [2017-04-27 Thu 19:32]
    :LOGBOOK:
    - State "STARTED"    from "DONE"       [2017-04-27 Thu 15:39]
    CLOCK: [2017-04-27 Thu 15:29]
    :END:
*** DONE 2017年4月27日 晚上<2017-04-27 Thu 19:39> 颜色和比例 98.8%
    CLOSED: [2017-04-27 Thu 19:51]
    :LOGBOOK:
    - State "DONE"       from "STARTED"    [2017-04-27 Thu 19:51]
    CLOCK: [2017-04-27 Thu 19:40]--[2017-04-27 Thu 19:51] =>  0:11
    :END:
** DONE 2017年4月28日<2017-04-28 Fri 08:28>介词.空间位置 97.9%
   CLOSED: [2017-04-28 Fri 08:46]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-04-28 Fri 08:46]
   CLOCK: [2017-04-28 Fri 08:28]--[2017-04-28 Fri 08:46] =>  0:18
   :END:
** DONE on the road<2017-04-29 Sat 09:11>
   CLOSED: [2017-04-29 Sat 10:43]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-04-29 Sat 10:43]
   CLOCK: [2017-04-29 Sat 09:11]--[2017-04-29 Sat 10:43] =>  1:32
   :END:
** DONE 2017年4月29日<2017-04-29 Sat 09:17>代词 95.0%
   CLOSED: [2017-04-29 Sat 09:36]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-04-29 Sat 09:36]
   CLOCK: [2017-04-29 Sat 09:17]--[2017-04-29 Sat 09:36] =>  0:19
   :END:
** DONE 2017年4月30日<2017-04-30 Sun 21:34>代词 96.1%
   CLOSED: [2017-04-30 Sun 21:49]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-04-30 Sun 21:49]
   CLOCK: [2017-04-30 Sun 21:34]--[2017-04-30 Sun 21:49] =>  0:15
   :END:
** DONE 2017年5月1日<2017-05-01 Mon 12:11>代词 95%
   CLOSED: [2017-05-01 Mon 12:33]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-05-01 Mon 12:33]
   CLOCK: [2017-05-01 Mon 12:11]--[2017-05-01 Mon 12:33] =>  0:22
   :END:
*** DONE 2017年5月1日 下午<2017-05-01 Mon 16:34> 代词 97%
    CLOSED: [2017-05-01 Mon 16:56]
    :LOGBOOK:
    - State "DONE"       from "STARTED"    [2017-05-01 Mon 16:56]
    CLOCK: [2017-05-01 Mon 16:34]--[2017-05-01 Mon 16:56] =>  0:22
    :END:
** DONE 2017年5月2日<2017-05-02 Tue 11:54>介词.空间位置 96.5%
   CLOSED: [2017-05-02 Tue 12:07]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-05-02 Tue 12:07]
   CLOCK: [2017-05-02 Tue 11:54]--[2017-05-02 Tue 12:07] =>  0:13
   :END:
*** DONE 2017年5月2日 下午<2017-05-02 Tue 19:07>介词.空间位置 98.2%
    CLOSED: [2017-05-02 Tue 19:19]
    :LOGBOOK:
    - State "DONE"       from "STARTED"    [2017-05-02 Tue 19:19]
    CLOCK: [2017-05-02 Tue 19:07]--[2017-05-02 Tue 19:19] =>  0:12
    :END:
** DONE 2017年5月3日<2017-05-03 Wed 19:00>颜色和比例 99.7%
   CLOSED: [2017-05-03 Wed 19:10]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-05-03 Wed 19:10]
   CLOCK: [2017-05-03 Wed 19:00]--[2017-05-03 Wed 19:10] =>  0:10
   :END:
*** DONE 2017年5月3日 <2017-05-03 Wed 19:12>常用单词 98.4%
    CLOSED: [2017-05-03 Wed 19:20]
    :LOGBOOK:
    - State "DONE"       from "STARTED"    [2017-05-03 Wed 19:20]
    CLOCK: [2017-05-03 Wed 19:12]--[2017-05-03 Wed 19:20] =>  0:08
    :END:
*** DONE 2017年5月3日<2017-05-03 Wed 19:20>常用单词 99.6%
    CLOSED: [2017-05-03 Wed 19:29]
    :LOGBOOK:
    - State "DONE"       from "STARTED"    [2017-05-03 Wed 19:29]
    CLOCK: [2017-05-03 Wed 19:20]--[2017-05-03 Wed 19:29] =>  0:09
    :END:
** DONE 2017年5月4日<2017-05-04 Thu 19:12>介词.空间位置 98.7%
   CLOSED: [2017-05-04 Thu 19:33]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-05-04 Thu 19:33]
   CLOCK: [2017-05-04 Thu 19:12]--[2017-05-04 Thu 19:33] =>  0:21
   :END:
** DONE 2017年5月4日 晚<2017-05-04 Thu 19:39>介词.空间位置 98.0%
   CLOSED: [2017-05-04 Thu 19:53]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-05-04 Thu 19:53]
   CLOCK: [2017-05-04 Thu 19:39]--[2017-05-04 Thu 19:53] =>  0:14
   :END:
** DONE 2017年5月7日<2017-05-07 Sun 08:52>介词.空间位置98.1%
   CLOSED: [2017-05-07 Sun 09:04]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-05-07 Sun 09:04]
   CLOCK: [2017-05-07 Sun 08:52]--[2017-05-07 Sun 09:04] =>  0:12
   :END:
** DONE 2017年5月8日<2017-05-08 Mon 19:01>介词.空间位置98.1%
   CLOSED: [2017-05-08 Mon 19:23]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-05-08 Mon 19:23]
   CLOCK: [2017-05-08 Mon 19:01]
   :END:
** DONE 2017年5月10日<2017-05-10 Wed 19:19>
   CLOSED: [2017-05-10 Wed 19:30]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-05-10 Wed 19:30]
   CLOCK: [2017-05-10 Wed 19:19]--[2017-05-10 Wed 19:30] =>  0:11
   :END:
** DONE 2017年5月11日<2017-05-11 Thu 18:56>介词.空间位置99.4%
   CLOSED: [2017-05-11 Thu 19:08]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-05-11 Thu 19:08]
   CLOCK: [2017-05-11 Thu 18:56]--[2017-05-11 Thu 19:08] =>  0:12
   :END:
* Learn github
** DONE how to use github<2017-04-23 Sun 11:00
   CLOSED: [2017-04-23 Sun 11:00]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-04-23 Sun 11:00]
   CLOCK: [2017-04-23 Sun 10:14]--[2017-04-23 Sun 11:00] =>  0:46
   :END:
从零开始学习github【初识GitHub】https://zhuanlan.zhihu.com/p/21103336?refer=stormzhang
从零开始学习github【加入GitHub】https://zhuanlan.zhihu.com/p/21113342?refer=stormzhang
* Learn JavaScript
** DONE fix eclipse<2017-04-23 Sun 14:51>
   CLOSED: [2017-04-23 Sun 14:51]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-04-23 Sun 14:51]
   CLOCK: [2017-04-23 Sun 14:43]--[2017-04-23 Sun 14:51] =>  0:08
   :END:
** DONE 作业<2017-04-24 Mon 04:05>
   CLOSED: [2017-04-24 Mon 17:12]
   :LOGBOOK:  
   - State "DONE"       from "STARTED"    [2017-04-24 Mon 17:12]
   :END:      
** DONE match<2017-04-25 Tue 07:30>
   CLOSED: [2017-04-25 Tue 19:58]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-04-25 Tue 19:58]
   CLOCK: [2017-04-25 Tue 19:30]--[2017-04-25 Tue 19:58] =>  0:28
   :END:
** DONE 安装Eclipse<2017-04-27 Thu 20:33>
   CLOSED: [2017-04-27 Thu 20:48]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-04-27 Thu 20:48]
   CLOCK: [2017-04-27 Thu 20:33]--[2017-04-27 Thu 20:48] =>  0:15
   :END:
** DONE Java爬虫<2017-05-01 Mon 18:20>
   CLOSED: [2017-05-01 Mon 19:11]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-05-01 Mon 19:11]
   CLOCK: [2017-05-01 Mon 18:20]--[2017-05-01 Mon 19:11] =>  0:51
   :END:
** DONE WebMagic爬虫<2017-05-02 Tue 11:39>
   CLOSED: [2017-05-02 Tue 11:53]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-05-02 Tue 11:53]
   CLOCK: [2017-05-02 Tue 11:39]--[2017-05-02 Tue 11:53] =>  0:14
   :END:
** DONE java<2017-05-03 Wed 19:37>
   CLOSED: [2017-05-03 Wed 20:27]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-05-03 Wed 20:27]
   CLOCK: [2017-05-03 Wed 19:37]
   :END:
** DONE 复习<2017-05-04 Thu 20:05>
   CLOSED: [2017-05-04 Thu 20:57]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-05-04 Thu 20:57]
   CLOCK: [2017-05-04 Thu 20:56]--[2017-05-04 Thu 20:57] =>  0:01
   :END:
** DONE Java <2017-05-06 Sat 21:06>
   CLOSED: [2017-05-06 Sat 22:52]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-05-06 Sat 22:52]
   CLOCK: [2017-05-06 Sat 21:06]--[2017-05-06 Sat 22:52] =>  1:46
   :END:
** DONE relax<2017-05-03 Wed 20:32>
   CLOSED: [2017-05-03 Wed 20:57]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-05-03 Wed 20:57]
   CLOCK: [2017-05-03 Wed 20:32]--[2017-05-03 Wed 20:57] =>  0:25
   :END:
** DONE 方法重载<2017-05-07 Sun 09:05>
   CLOSED: [2017-05-07 Sun 13:28]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-05-07 Sun 13:28]
   CLOCK: [2017-05-07 Sun 09:06]--[2017-05-07 Sun 13:28] =>  4:22
   :END:
** DONE 包的创建<2017-05-07 Sun 13:39>
   CLOSED: [2017-05-07 Sun 14:45]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-05-07 Sun 14:45]
   CLOCK: [2017-05-07 Sun 13:39]--[2017-05-07 Sun 14:45] =>  1:06
   :END:
** DONE Java<2017-05-07 Sun 15:03>
   CLOSED: [2017-05-07 Sun 15:52]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-05-07 Sun 15:52]
   CLOCK: [2017-05-07 Sun 15:03]--[2017-05-07 Sun 15:52] =>  0:49
   :END:
** DONE 程序练习<2017-05-07 Sun 19:00>
   CLOSED: [2017-05-08 Mon 18:58]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-05-08 Mon 18:58]
   CLOCK: [2017-05-07 Sun 19:00]--[2017-05-08 Mon 18:58] => 23:58
   :END:
** DONE 继承<2017-05-08 Mon 19:24>
   CLOSED: [2017-05-08 Mon 21:43]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-05-08 Mon 21:43]
   CLOCK: [2017-05-08 Mon 19:25]--[2017-05-08 Mon 21:43] =>  2:18
   :END:
** DONE 继承2<2017-05-09 Tue 19:54>
   CLOSED: [2017-05-09 Tue 20:55]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-05-09 Tue 20:55]
   CLOCK: [2017-05-09 Tue 19:54]--[2017-05-09 Tue 20:55] =>  1:01
   :END:

** DONE this和super关键字<2017-05-11 Thu 19:10>
   CLOSED: [2017-05-11 Thu 21:01]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-05-11 Thu 21:01]
   CLOCK: [2017-05-11 Thu 19:10]--[2017-05-11 Thu 21:01] =>  1:51
   :END:
* Learn zilongshanren video
** DONE day17-lispy<2017-04-26 Wed 14:53>
   CLOSED: [2017-04-26 Wed 15:37]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-04-26 Wed 15:37]
   CLOCK: [2017-04-26 Wed 14:53]--[2017-04-26 Wed 15:37] =>  0:44
   :END:
** DONE learn elisp<2017-04-26 Wed 15:38>
   CLOSED: [2017-04-26 Wed 16:11]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-04-26 Wed 16:11]
   CLOCK: [2017-04-26 Wed 15:38]--[2017-04-26 Wed 16:11] =>  0:33
   :END:
*** DONE relax<2017-04-26 Wed 16:33>
    CLOSED: [2017-04-26 Wed 16:44]
    :LOGBOOK:
    - State "DONE"       from "STARTED"    [2017-04-26 Wed 16:44]
    CLOCK: [2017-04-26 Wed 16:32]--[2017-04-26 Wed 16:44] =>  0:12
    :END:
** DONE elisp <2017-04-27 Thu 08:37>
   CLOSED: [2017-04-27 Thu 10:13]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-04-27 Thu 10:13]
   CLOCK: [2017-04-27 Thu 08:37]--[2017-04-27 Thu 10:13] =>  1:36
   :END:
*** DONE learn elisp<2017-04-27 Thu 14:25>
    CLOSED: [2017-04-27 Thu 15:16]
    :LOGBOOK:
    - State "DONE"       from "STARTED"    [2017-04-27 Thu 15:16]
    CLOCK: [2017-04-27 Thu 14:25]--[2017-04-27 Thu 15:16] =>  0:51
    :END:
** DONE relax<2017-04-27 Thu 16:09>
   CLOSED: [2017-04-27 Thu 16:50]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-04-27 Thu 16:50]
   CLOCK: [2017-04-27 Thu 16:10]--[2017-04-27 Thu 16:50] =>  0:40
   :END:
** DONE org-mode<2017-04-27 Thu 19:54>
   CLOSED: [2017-04-27 Thu 20:11]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-04-27 Thu 20:11]
   CLOCK: [2017-04-27 Thu 19:54]--[2017-04-27 Thu 20:11] =>  0:17
   :END:
** DONE org-mode<2017-05-04 Thu 19:58>
   CLOSED: [2017-05-04 Thu 19:59]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-05-04 Thu 19:59]
   :END:
** DONE learn org-mode<2017-05-04 Thu 20:00>
   CLOSED: [2017-05-04 Thu 20:03]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-05-04 Thu 20:03]
   CLOCK: [2017-05-04 Thu 20:00]--[2017-05-04 Thu 20:03] =>  0:03
* elisp
** DONE 2017年4月28日<2017-04-28 Fri 09:07>
   CLOSED: [2017-04-28 Fri 09:19]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-04-28 Fri 09:19]
   CLOCK: [2017-04-28 Fri 09:07]--[2017-04-28 Fri 09:19] =>  0:12
   :END:
*** DONE learn elisp <2017-04-28 Fri 09:38>
    CLOSED: [2017-04-28 Fri 11:49]
    :LOGBOOK:
    - State "DONE"       from "STARTED"    [2017-04-28 Fri 11:49]
    CLOCK: [2017-04-28 Fri 09:38]--[2017-04-28 Fri 11:49] =>  2:11
    :END:
** DONE learn elisp<2017-05-02 Tue 19:56>
   CLOSED: [2017-05-02 Tue 20:55]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-05-02 Tue 20:55]
   CLOCK: [2017-05-02 Tue 19:57]--[2017-05-02 Tue 20:55] =>  0:58
   :END:
